result/cohttp-lwt-2.5.log
Running 1m test @ http://localhost:8000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 1003.227ms, rate sampling interval: 3117ms
  Thread calibration: mean lat.: 1001.631ms, rate sampling interval: 3131ms
  Thread calibration: mean lat.: 1026.814ms, rate sampling interval: 3125ms
  Thread calibration: mean lat.: 1062.248ms, rate sampling interval: 3153ms
  Thread calibration: mean lat.: 971.692ms, rate sampling interval: 3102ms
  Thread calibration: mean lat.: 966.662ms, rate sampling interval: 3092ms
  Thread calibration: mean lat.: 998.026ms, rate sampling interval: 3115ms
  Thread calibration: mean lat.: 989.437ms, rate sampling interval: 3127ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.39s     6.21s    0.86m    93.00%
    Req/Sec     3.08k   104.50     3.21k    77.78%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.17s 
 75.000%    7.17s 
 90.000%    8.43s 
 99.000%   40.44s 
 99.900%   50.95s 
 99.990%    0.86m 
 99.999%    0.86m 
100.000%    0.86m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     783.871     0.000000            1         1.00
    2201.599     0.100000       108070         1.11
    2785.279     0.200000       215399         1.25
    3600.383     0.300000       323324         1.43
    4296.703     0.400000       430981         1.67
    5169.151     0.500000       538735         2.00
    5660.671     0.550000       592565         2.22
    6053.887     0.600000       646551         2.50
    6422.527     0.650000       700100         2.86
    6782.975     0.700000       753960         3.33
    7172.095     0.750000       808097         4.00
    7364.607     0.775000       835145         4.44
    7548.927     0.800000       861922         5.00
    7737.343     0.825000       888916         5.71
    7925.759     0.850000       915824         6.67
    8138.751     0.875000       942454         8.00
    8269.823     0.887500       955965         8.89
    8429.567     0.900000       969470        10.00
    9011.199     0.912500       982691        11.43
   11419.647     0.925000       996165        13.33
   14721.023     0.937500      1009801        16.00
   15482.879     0.943750      1016349        17.78
   16539.647     0.950000      1023152        20.00
   17989.631     0.956250      1029859        22.86
   19890.175     0.962500      1036534        26.67
   26902.527     0.968750      1043278        32.00
   28344.319     0.971875      1046651        35.56
   29409.279     0.975000      1050089        40.00
   30261.247     0.978125      1053374        45.71
   31178.751     0.981250      1056753        53.33
   32161.791     0.984375      1060163        64.00
   33046.527     0.985938      1061773        71.11
   39256.063     0.987500      1063571        80.00
   40009.727     0.989062      1065138        91.43
   40599.551     0.990625      1066844       106.67
   41058.303     0.992188      1068560       128.00
   41254.911     0.992969      1069468       142.22
   41418.751     0.993750      1070202       160.00
   41648.127     0.994531      1071092       182.86
   41844.735     0.995313      1071955       213.33
   42172.415     0.996094      1072803       256.00
   42401.791     0.996484      1073194       284.44
   42598.399     0.996875      1073618       320.00
   42795.007     0.997266      1074007       365.71
   43057.151     0.997656      1074454       426.67
   43319.295     0.998047      1074838       512.00
   50397.183     0.998242      1075030       568.89
   50593.791     0.998437      1075314       640.00
   50724.863     0.998633      1075503       731.43
   50855.935     0.998828      1075693       853.33
   50954.239     0.999023      1075882      1024.00
   51019.775     0.999121      1075978      1137.78
   51085.311     0.999219      1076075      1280.00
   51183.615     0.999316      1076177      1462.86
   51281.919     0.999414      1076366      1706.67
   51347.455     0.999512      1076463      2048.00
   51347.455     0.999561      1076463      2275.56
   51412.991     0.999609      1076554      2560.00
   51412.991     0.999658      1076554      2925.71
   51478.527     0.999707      1076644      3413.33
   51511.295     0.999756      1076684      4096.00
   51511.295     0.999780      1076684      4551.11
   51544.063     0.999805      1076734      5120.00
   51544.063     0.999829      1076734      5851.43
   51609.599     0.999854      1076823      6826.67
   51609.599     0.999878      1076823      8192.00
   51609.599     0.999890      1076823      9102.22
   51609.599     0.999902      1076823     10240.00
   51609.599     0.999915      1076823     11702.86
   51675.135     0.999927      1076912     13653.33
   51675.135     1.000000      1076912          inf
#[Mean    =     6392.709, StdDeviation   =     6210.329]
#[Max     =    51642.368, Total count    =      1076912]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1383820 requests in 1.00m, 2.70GB read
  Socket errors: connect 0, read 2059, write 0, timeout 0
Requests/sec:  23061.07
Transfer/sec:     46.05MB