result/cohttp-lwt-3.0.log
Running 1m test @ http://localhost:8000/
  8 threads and 10000 connections
  Thread calibration: mean lat.: 991.764ms, rate sampling interval: 8220ms
  Thread calibration: mean lat.: 999.310ms, rate sampling interval: 8404ms
  Thread calibration: mean lat.: 802.822ms, rate sampling interval: 6111ms
  Thread calibration: mean lat.: 1191.940ms, rate sampling interval: 9805ms
  Thread calibration: mean lat.: 894.247ms, rate sampling interval: 7221ms
  Thread calibration: mean lat.: 950.727ms, rate sampling interval: 7614ms
  Thread calibration: mean lat.: 1126.184ms, rate sampling interval: 9035ms
  Thread calibration: mean lat.: 994.494ms, rate sampling interval: 8347ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.93s    10.16s    0.98m    86.11%
    Req/Sec     1.04k   124.95     1.29k    65.85%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   64.54ms
 75.000%    3.46s 
 90.000%   20.28s 
 99.000%   43.29s 
 99.900%    0.87m 
 99.990%    0.95m 
 99.999%    0.97m 
100.000%    0.98m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.110     0.000000            1         1.00
      13.095     0.100000        36452         1.11
      25.199     0.200000        72886         1.25
      37.023     0.300000       109334         1.43
      49.407     0.400000       145795         1.67
      64.543     0.500000       182199         2.00
      74.431     0.550000       200491         2.22
      86.399     0.600000       218684         2.50
     106.111     0.650000       236851         2.86
     172.031     0.700000       255071         3.33
    3457.023     0.750000       273286         4.00
    6000.639     0.775000       282402         4.44
    8536.063     0.800000       291515         5.00
   11091.967     0.825000       300629         5.71
   13828.095     0.850000       309734         6.67
   16769.023     0.875000       318836         8.00
   18399.231     0.887500       323407         8.89
   20283.391     0.900000       327957        10.00
   22396.927     0.912500       332497        11.43
   24575.999     0.925000       337080        13.33
   26951.679     0.937500       341633        16.00
   28246.015     0.943750       343906        17.78
   29671.423     0.950000       346175        20.00
   31211.519     0.956250       348451        22.86
   32833.535     0.962500       350720        26.67
   34570.239     0.968750       353004        32.00
   35553.279     0.971875       354140        35.56
   36601.855     0.975000       355275        40.00
   37781.503     0.978125       356430        45.71
   39092.223     0.981250       357564        53.33
   40468.479     0.984375       358711        64.00
   41156.607     0.985938       359275        71.11
   41910.271     0.987500       359838        80.00
   42762.239     0.989062       360410        91.43
   43679.743     0.990625       360969       106.67
   44793.855     0.992188       361534       128.00
   45416.447     0.992969       361822       142.22
   46071.807     0.993750       362103       160.00
   46825.471     0.994531       362400       182.86
   47644.671     0.995313       362673       213.33
   48529.407     0.996094       362965       256.00
   48955.391     0.996484       363107       284.44
   49414.143     0.996875       363246       320.00
   49938.431     0.997266       363385       365.71
   50429.951     0.997656       363529       426.67
   50921.471     0.998047       363676       512.00
   51150.847     0.998242       363740       568.89
   51412.991     0.998437       363817       640.00
   51642.367     0.998633       363882       731.43
   51970.047     0.998828       363957       853.33
   52330.495     0.999023       364026      1024.00
   52494.335     0.999121       364060      1137.78
   52756.479     0.999219       364100      1280.00
   53051.391     0.999316       364131      1462.86
   53411.839     0.999414       364168      1706.67
   53837.823     0.999512       364204      2048.00
   54067.199     0.999561       364222      2275.56
   54296.575     0.999609       364239      2560.00
   54558.719     0.999658       364257      2925.71
   54886.399     0.999707       364275      3413.33
   55214.079     0.999756       364292      4096.00
   55672.831     0.999780       364300      4551.11
   55934.975     0.999805       364310      5120.00
   56131.583     0.999829       364318      5851.43
   56393.727     0.999854       364327      6826.67
   56590.335     0.999878       364336      8192.00
   56688.639     0.999890       364340      9102.22
   56885.247     0.999902       364346     10240.00
   57081.855     0.999915       364350     11702.86
   57245.695     0.999927       364354     13653.33
   57442.303     0.999939       364358     16384.00
   57507.839     0.999945       364360     18204.44
   57606.143     0.999951       364364     20480.00
   57671.679     0.999957       364366     23405.71
   57737.215     0.999963       364369     27306.67
   57737.215     0.999969       364369     32768.00
   57835.519     0.999973       364370     36408.89
   57868.287     0.999976       364372     40960.00
   57901.055     0.999979       364374     46811.43
   57901.055     0.999982       364374     54613.33
   57933.823     0.999985       364375     65536.00
   57933.823     0.999986       364375     72817.78
   58032.127     0.999988       364377     81920.00
   58032.127     0.999989       364377     93622.86
   58032.127     0.999991       364377    109226.67
   58130.431     0.999992       364378    131072.00
   58130.431     0.999993       364378    145635.56
   58130.431     0.999994       364378    163840.00
   58163.199     0.999995       364379    187245.71
   58163.199     0.999995       364379    218453.33
   58163.199     0.999996       364379    262144.00
   58163.199     0.999997       364379    291271.11
   58163.199     0.999997       364379    327680.00
   58654.719     0.999997       364380    374491.43
   58654.719     1.000000       364380          inf
#[Mean    =     4927.880, StdDeviation   =    10155.215]
#[Max     =    58621.952, Total count    =       364380]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  429235 requests in 1.00m, 857.18MB read
  Socket errors: connect 0, read 9881, write 97, timeout 16762
Requests/sec:   7122.74
Transfer/sec:     14.22MB